<!DOCTYPE HTML>
<html lang="en" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>手動操作 | 動作環境</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.1.0">
        
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="../gitbook/style.css">
    
    

        
    
    
    <link rel="next" href="../Chapter3/script.html" />
    
    
    <link rel="prev" href="../Chapter1/dashboard.html" />
    

        
    </head>
    <body>
        
        
    <div class="book" data-level="3" data-basepath=".." data-revision="Sun Jun 28 2015 11:51:14 GMT+0900 (JST)">
    

<div class="book-summary">
    <div class="book-search">
        <input type="text" placeholder="Type to search" class="form-control" />
    </div>
    <ul class="summary">
        
        
        
        

        

        
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="../index.html">
                        <i class="fa fa-check"></i>
                        
                        動作環境
                    </a>
                
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="Chapter0/login.html">
            
                
                    <a href="../Chapter0/login.html">
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        ログイン
                    </a>
                
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="Chapter1/dashboard.html">
            
                
                    <a href="../Chapter1/dashboard.html">
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        ダッシュボード
                    </a>
                
            
            
        </li>
    
        <li class="chapter active" data-level="3" data-path="Chapter2/operation.html">
            
                
                    <a href="../Chapter2/operation.html">
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        手動操作
                    </a>
                
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="Chapter3/script.html">
            
                
                    <a href="../Chapter3/script.html">
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        スクリプト生成
                    </a>
                
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="Chapter4/autotest.html">
            
                
                    <a href="../Chapter4/autotest.html">
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        自動テスト
                    </a>
                
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="Chapter5/history.html">
            
                
                    <a href="../Chapter5/history.html">
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        各種履歴
                    </a>
                
            
            
        </li>
    
        <li class="chapter " data-level="7" data-path="Chapter6/account.html">
            
                
                    <a href="../Chapter6/account.html">
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        アカウント
                    </a>
                
            
            
        </li>
    


        
        <li class="divider"></li>
        <li>
            <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                Published with GitBook
            </a>
        </li>
        
    </ul>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header">
    <!-- Actions Left -->
    <a href="#" class="btn pull-left toggle-summary" aria-label="Table of Contents"><i class="fa fa-align-justify"></i></a>
    <a href="#" class="btn pull-left toggle-search" aria-label="Search"><i class="fa fa-search"></i></a>
    
    <div id="font-settings-wrapper" class="dropdown pull-left">
        <a href="#" class="btn toggle-dropdown" aria-label="Font Settings"><i class="fa fa-font"></i>
        </a>
        <div class="dropdown-menu font-settings">
    <div class="dropdown-caret">
        <span class="caret-outer"></span>
        <span class="caret-inner"></span>
    </div>

    <div class="buttons">
        <button type="button" id="reduce-font-size" class="button size-2">A</button>
        <button type="button" id="enlarge-font-size" class="button size-2">A</button>
    </div>

    <div class="buttons font-family-list">
        <button type="button" data-font="0" class="button">Serif</button>
        <button type="button" data-font="1" class="button">Sans</button>
    </div>

    <div class="buttons color-theme-list">
        <button type="button" id="color-theme-preview-0" class="button size-3" data-theme="0">White</button>
        <button type="button" id="color-theme-preview-1" class="button size-3" data-theme="1">Sepia</button>
        <button type="button" id="color-theme-preview-2" class="button size-3" data-theme="2">Night</button>
    </div>
</div>

    </div>

    <!-- Actions Right -->
    
    <div class="dropdown pull-right">
        <a href="#" class="btn toggle-dropdown" aria-label="Share"><i class="fa fa-share-alt"></i>
        </a>
        <div class="dropdown-menu font-settings dropdown-left">
            <div class="dropdown-caret">
                <span class="caret-outer"></span>
                <span class="caret-inner"></span>
            </div>
            <div class="buttons">
                <button type="button" data-sharing="twitter" class="button">
                    Share on Twitter
                </button>
                <button type="button" data-sharing="google-plus" class="button">
                    Share on Google
                </button>
                <button type="button" data-sharing="facebook" class="button">
                    Share on Facebook
                </button>
                <button type="button" data-sharing="weibo" class="button">
                    Share on Weibo
                </button>
                <button type="button" data-sharing="instapaper" class="button">
                    Share on Instapaper
                </button>
            </div>
        </div>
    </div>
    

    
    <a href="#" target="_blank" class="btn pull-right google-plus-sharing-link sharing-link" data-sharing="google-plus" aria-label="Google"><i class="fa fa-google-plus"></i></a>
    
    
    <a href="#" target="_blank" class="btn pull-right facebook-sharing-link sharing-link" data-sharing="facebook" aria-label="Facebook"><i class="fa fa-facebook"></i></a>
    
    
    <a href="#" target="_blank" class="btn pull-right twitter-sharing-link sharing-link" data-sharing="twitter" aria-label="Twitter"><i class="fa fa-twitter"></i></a>
    
    
    


    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../" >動作環境</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <p><strong>&#x624B;&#x52D5;&#x64CD;&#x4F5C;&#x753B;&#x9762;</strong>  </p>
<p><img src="operation1.png" alt=""><br>&#x3000;&#x5DE6;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x3067;&#x3001;&#x201C;&#x624B;&#x52D5;&#x64CD;&#x4F5C;&#x201D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3068;&#x4E0A;&#x8A18;&#x306E;&#x201C;&#x7AEF;&#x672B;&#x9078;&#x629E;&#x201D;&#x753B;&#x9762;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x3053;&#x3053;&#x3067;&#x306F;&#x3001;&#x30C6;&#x30B9;&#x30C8;&#x3059;&#x308B;&#x7AEF;&#x672B;&#x3092;OS&#x3084;&#x30E1;&#x30FC;&#x30AB;&#x30FC;&#x3001;&#x89E3;&#x50CF;&#x5EA6;&#x3067;&#x30D5;&#x30A3;&#x30EB;&#x30BF;&#x30EA;&#x30F3;&#x30B0;&#x3057;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x4ECA;&#x56DE;&#x306F;&#x3001;&#x89E3;&#x50CF;&#x5EA6;&#x300C;1280&#xD7;720&#x300D;&#x3067;&#x30D5;&#x30A3;&#x30EB;&#x30BF;&#x30EA;&#x30F3;&#x30B0;&#x3092;&#x639B;&#x3051;&#x3066;&#x307F;&#x307E;&#x3057;&#x305F;&#x3002;&#x7D50;&#x679C;&#x304C;&#x53F3;&#x306E;&#x201C;&#x7AEF;&#x672B;&#x4E00;&#x89A7;&#x201D;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x30D5;&#x30A3;&#x30EB;&#x30BF;&#x30EA;&#x30F3;&#x30B0;&#x7D50;&#x679C;&#x306E;2&#x53F0;&#x306E;&#x7AEF;&#x672B;&#x304C;&#x4E21;&#x65B9;&#x3068;&#x3082;&#x3001;&#x201C;&#x5229;&#x7528;&#x3059;&#x308B;&#x201D;&#x3068;
&#x9752;&#x5857;&#x308A;&#x306E;&#x30DC;&#x30BF;&#x30F3;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x3001;&#x30C6;&#x30B9;&#x30C8;&#x5B9F;&#x65BD;&#x304C;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;<br>&#x3000;&#x4ED6;&#x306E;&#x304A;&#x5BA2;&#x69D8;&#x304C;&#x3054;&#x5229;&#x7528;&#x4E2D;&#x306E;&#x7AEF;&#x672B;&#x306F;&#x3001;&#x201C;&#x4F7F;&#x7528;&#x4E2D;&#x201D;&#x3068;&#x767D;&#x5857;&#x308A;&#x306E;&#x30DC;&#x30BF;&#x30F3;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x306E;&#x3067;&#x3001;&#x305D;&#x306E;&#x969B;&#x306F;&#x3001;&#x3057;&#x3070;&#x3089;&#x304F;&#x304A;&#x5F85;&#x3061;&#x4E0B;&#x3055;&#x3044;&#x3002;<br>&#x3000;
<img src="operation2.png" alt=""><br>&#x3000;&#x30C6;&#x30B9;&#x30C8;&#x3057;&#x305F;&#x3044;&#x7AEF;&#x672B;&#x306E;&#x201C;&#x5229;&#x7528;&#x3059;&#x308B;&#x201D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3068;&#x4E0A;&#x8A18;&#x753B;&#x9762;&#x306B;&#x79FB;&#x308A;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x307E;&#x305A;&#x306F;&#x3001;&#x9078;&#x3093;&#x3060;&#x7AEF;&#x672B;&#x306E;&#x7AEF;&#x672B;&#x60C5;&#x5831;&#x8A73;&#x7D30;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x3066;&#x307F;&#x307E;&#x3059;&#x3002;&#x201C;&#x7AEF;&#x672B;&#x60C5;&#x5831;&#x201D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;<br>&#x3000;
&#x3000;&#x25A0;&#x6CE8;&#x610F;&#x4E8B;&#x9805;<br>&#x3000;&#x201C;&#x5229;&#x7528;&#x53EF;&#x80FD;&#x6642;&#x9593;&#x201D;&#x306F;&#x3054;&#x5951;&#x7D04;&#x5185;&#x5BB9;&#x306B;&#x3088;&#x308A;&#x7570;&#x306A;&#x308A;&#x307E;&#x3059;&#x304C;&#x3001;&#x4E00;&#x56DE;&#x306B;&#x5229;&#x7528;&#x3067;&#x304D;&#x308B;&#x6B8B;&#x308A;&#x6642;&#x9593;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x5229;&#x7528;&#x53EF;&#x80FD;&#x6642;&#x9593;&#x304C;&#x201C;0&#x201D;&#x306B;&#x306A;&#x308B;&#x3068;&#x5F37;&#x5236;&#x7684;&#x306B;&#x7D42;&#x4E86;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x306E;&#x3067;&#x3001;&#x5229;&#x7528;&#x53EF;&#x80FD;&#x6642;&#x9593;&#x3092;&#x30C1;&#x30A7;&#x30C3;&#x30AF;&#x3057;&#x306A;&#x304C;&#x3089;&#x3001;&#x30C6;&#x30B9;&#x30C8;&#x3092;&#x9032;&#x3081;&#x3066;&#x9802;&#x3051;&#x307E;&#x3059;&#x69D8;&#x304A;&#x9858;&#x3044;&#x81F4;&#x3057;&#x307E;&#x3059;&#x3002;  </p>
<p><img src="operation3.png" alt=""><br>&#x3000;&#x7AEF;&#x672B;&#x60C5;&#x5831;&#x8A73;&#x7D30;&#x304C;&#x4E0A;&#x8A18;&#x306E;&#x3088;&#x3046;&#x306B;&#x30DD;&#x30C3;&#x30D7;&#x30A2;&#x30C3;&#x30D7;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x7AEF;&#x672B;&#x60C5;&#x5831;&#x8A73;&#x7D30;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x305F;&#x3089;&#x3001;&#x201C;Close&#x201D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x62BC;&#x3057;&#x3066;&#x3001;&#x78BA;&#x8A8D;&#x7D42;&#x4E86;&#x3067;&#x3059;&#x3002;</p>
<p><img src="operation4.png" alt=""><br>&#x3000;&#x30D1;&#x30BD;&#x30B3;&#x30F3;&#x304B;&#x3089;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30D5;&#x30A9;&#x30F3;&#x3092;&#x64CD;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x304D;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x30B5;&#x30A4;&#x30C8;&#x306E;&#x78BA;&#x8A8D;&#x3084;&#x3001;&#x753B;&#x9762;&#x3092;&#x56DE;&#x8EE2;&#x3057;&#x305F;&#x969B;&#x306E;&#x78BA;&#x8A8D;&#x7B49;&#x3092;&#x3053;&#x3053;&#x3067;&#x64CD;&#x4F5C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
  &#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30D5;&#x30A9;&#x30F3;&#x3092;&#x56DE;&#x8EE2;&#x3055;&#x305B;&#x3066;&#x307F;&#x307E;&#x3059;&#x3002;&#x201C;Rotate Phone&#x201D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x307F;&#x307E;&#x3059;</p>
<p><img src="operation5.png" alt=""><br>&#x3000;&#x4E0A;&#x8A18;&#x306E;&#x3088;&#x3046;&#x306B;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30D5;&#x30A9;&#x30F3;&#x304C;&#x56DE;&#x8EE2;&#x3057;&#x305F;&#x753B;&#x50CF;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x300C;&#x30AB;&#x30E1;&#x30E9;&#x300D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x62BC;&#x305B;&#x3070;&#x3001;&#x30B9;&#x30AF;&#x30EA;&#x30FC;&#x30F3;&#x30B7;&#x30E7;&#x30C3;&#x30C8;&#x306E;&#x64AE;&#x5F71;&#x3082;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;</p>
<p><img src="operation6.png" alt=""><br>&#x3000;&#x4E0A;&#x8A18;&#x306E;&#x3088;&#x3046;&#x306B;&#x7AEF;&#x672B;&#x64CD;&#x4F5C;&#x753B;&#x9762;&#x306E;&#x4E0B;&#x306E;&#x30B9;&#x30AF;&#x30EA;&#x30FC;&#x30F3;&#x30B7;&#x30E7;&#x30C3;&#x30C8;&#x753B;&#x9762;&#x306B;&#x30B9;&#x30AF;&#x30EA;&#x30FC;&#x30F3;&#x30B7;&#x30E7;&#x30C3;&#x30C8;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;<br>&#x3000;
<img src="operation7.png" alt=""><br>&#x3000;&#x6B21;&#x306B;&#x3053;&#x306E;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30D5;&#x30A9;&#x30F3;&#x7AEF;&#x672B;&#x306B;&#x30A2;&#x30D7;&#x30EA;&#x3092;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3057;&#x3066;&#x307F;&#x307E;&#x3059;&#x3002;&#x201C;&#x30A2;&#x30D7;&#x30EA;&#x9078;&#x629E;&#x201D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x307F;&#x307E;&#x3059;&#x3002;<br>&#x3000;
<img src="operation8.png" alt=""><br>&#x4E0A;&#x8A18;&#x306E;&#x3088;&#x3046;&#x306B;&#x201C;Select your application&#x201D;&#x306E;&#x30DD;&#x30C3;&#x30D7;&#x30A2;&#x30C3;&#x30D7;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x306E;&#x3067;&#x3001;&#x3053;&#x3053;&#x306B;&#x30C6;&#x30B9;&#x30C8;&#x3057;&#x305F;&#x3044;&#x30A2;&#x30D7;&#x30EA;&#xFF08;apk&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#xFF09;&#x3092;&#x30C9;&#x30E9;&#x30C3;&#x30B0;&#xFF06;&#x30C9;&#x30ED;&#x30C3;&#x30D7;&#x3057;&#x307E;&#x3059;&#x3002;  </p>
<p><img src="operation9.png" alt=""><br>&#x3000;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x304C;&#x7121;&#x4E8B;&#x5B8C;&#x4E86;&#x3059;&#x308B;&#x3068;&#x3001;&#x4E0A;&#x8A18;&#x306E;&#x3088;&#x3046;&#x306A;&#x8868;&#x793A;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x3053;&#x3053;&#x3067;&#x306F;&#x3001;MovaTesting Demo &#x30A2;&#x30D7;&#x30EA;&#x3092;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x305F;&#x3002;&#x30A2;&#x30D7;&#x30EA;&#x3092;&#x9078;&#x629E;&#x3057;&#x3066;&#x3001;Select&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;<br>&#x3000;
<img src="operation10.png" alt=""><br>&#x3000;Select&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x5F8C;&#x3001;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3055;&#x308C;&#x305F;&#x30A2;&#x30D7;&#x30EA;&#x304C;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x8D77;&#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x4E0A;&#x8A18;&#x306F;&#x3001;MovaTesting Demo &#x30A2;&#x30D7;&#x30EA;&#x304C;&#x8D77;&#x52D5;&#x3057;&#x305F;&#x72B6;&#x614B;&#x3067;&#x3059;&#x3002;
&#x753B;&#x9762;&#x306E;&#x78BA;&#x8A8D;&#x3084;&#x30A2;&#x30D7;&#x30EA;&#x3092;&#x64CD;&#x4F5C;&#x3057;&#x3066;&#x3001;&#x30C6;&#x30B9;&#x30C8;&#x5B9F;&#x65BD;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<p>&#x3000;&#x9014;&#x4E2D;&#x3067;&#x30D5;&#x30EA;&#x30FC;&#x30BA;&#x3057;&#x3066;&#x3057;&#x307E;&#x3063;&#x305F;&#x969B;&#x3084;&#x3001;&#x9014;&#x4E2D;&#x3067;&#x30C6;&#x30B9;&#x30C8;&#x3092;&#x3084;&#x308A;&#x76F4;&#x3057;&#x305F;&#x3044;&#x5834;&#x5408;&#x306B;&#x306F;&#x3001;&#x201C;&#x30A2;&#x30D7;&#x30EA;&#x518D;&#x8D77;&#x52D5;&#x201D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308C;&#x3070;&#x3001;&#x305D;&#x308C;&#x307E;&#x3067;&#x306E;
&#x64CD;&#x4F5C;&#x30C7;&#x30FC;&#x30BF;&#x304C;&#x4E00;&#x65B0;&#x3055;&#x308C;&#x308B;&#x306E;&#x3067;&#x3001;&#x5FC5;&#x8981;&#x306B;&#x5FDC;&#x3058;&#x3066;&#x3054;&#x5229;&#x7528;&#x4E0B;&#x3055;&#x3044;&#x3002;</p>
<p>&#x3000;&#x201C;&#x25A0;&#x7D42;&#x4E86;&#x201D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3068;&#x30C6;&#x30B9;&#x30C8;&#x304C;&#x5B8C;&#x4E86;&#x3057;&#x3001;MovaTesting&#x306E;
&#x7AEF;&#x672B;&#x306B;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3057;&#x305F;&#x30A2;&#x30D7;&#x30EA;&#x3082;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x524A;&#x9664;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;  </p>
<p><img src="remoteADB1.png" alt=""><br>&#x3000;&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x3057;&#x306A;&#x304C;&#x3089;&#x958B;&#x767A;&#x3092;&#x3057;&#x305F;&#x3044;&#x969B;&#x7B49;&#x306B;&#x5229;&#x7528;&#x3059;&#x308B;&#x30EA;&#x30E2;&#x30FC;&#x30C8;ADB&#x6A5F;&#x80FD;&#x3002;Eclipse&#x3084;Android Stuidio&#x7B49;&#x306E;&#x958B;&#x767A;&#x30C4;&#x30FC;&#x30EB;&#x3068;&#x9023;&#x643A;&#x3057;&#x3066;&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x3057;&#x306A;&#x304C;&#x3089;&#x306E;&#x958B;&#x767A;&#x3092;&#x5B9F;&#x73FE;&#x3057;&#x307E;&#x3059;&#x3002;<br>&#x3000;
<img src="remoteADB2.png" alt=""><br>&#x3000;&#x624B;&#x52D5;&#x64CD;&#x4F5C;&#x306E;&#x30EA;&#x30E2;&#x30FC;&#x30C8;ADB&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3068;&#x4E0A;&#x8A18;&#x753B;&#x9762;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x3053;&#x3067;&#x3001;&#x307E;&#x305A;&#x3001;&#x201C;Mova ADB&#x201D;&#x3092;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3057;&#x307E;&#x3059;&#x3002; 
&#x3000;
<img src="remoteADB3.png" alt=""><br>&#x53F3;&#x4E0A;&#x306E;&#x201C;CHROME&#x306B;&#x8FFD;&#x52A0;&#x201D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3057;&#x307E;&#x3059;&#x3002;  </p>
<p>&#x3000;&#x203B;&#x30EA;&#x30E2;&#x30FC;&#x30C8;ADB&#x306E;&#x6A5F;&#x80FD;&#x304C;&#x3054;&#x5229;&#x7528;&#x3067;&#x304D;&#x308B;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x306F;&#x3001;CHROME &#x306E;&#x307F;&#x3068;&#x306A;&#x3063;&#x3066;&#x304A;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<p><img src="remoteADB4.png" alt="">  </p>
<p>&#x4E0A;&#x8A18;&#x753B;&#x9762;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308C;&#x3070;&#x3001;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x304C;&#x5B8C;&#x4E86;&#x3067;&#x3059;&#x3002;</p>
<p><img src="remoteADB5.png" alt="">  </p>
<p>MovaTesting&#x306E;&#x624B;&#x52D5;&#x64CD;&#x4F5C;&#x753B;&#x9762;&#x306B;&#x623B;&#x308A;&#x3001;&#x201C;&#x30EA;&#x30E2;&#x30FC;&#x30C8;ADB&#x201D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3068;&#x2611;&#xFE0F;&#x304C;&#x5165;&#x308A;&#x307E;&#x3059;<br>&#x3000;&#x3053;&#x306E;&#x72B6;&#x614B;&#x304B;&#x3089;&#x3001;&#x30EA;&#x30E2;&#x30FC;&#x30C8;ADB&#x6A5F;&#x80FD;&#x304C;&#x3054;&#x5229;&#x7528;&#x9802;&#x3051;&#x308B;&#x72B6;&#x614B;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;  
&#x3000;</p>
<p><img src="operation12.png" alt=""><br>&#x3000;&#x6B21;&#x306B;&#x201C;&#x30B9;&#x30DE;&#x30DB;&#x304B;&#x3089;&#x201D;&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x307F;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F;&#x3001;&#x4F7F;&#x3044;&#x6163;&#x308C;&#x305F;
&#x304A;&#x624B;&#x6301;&#x3061;&#x306E;&#x7AEF;&#x672B;&#x3067;&#x30C6;&#x30B9;&#x30C8;&#x3057;&#x305F;&#x3044;&#x3001;&#x30D1;&#x30BD;&#x30B3;&#x30F3;&#x64CD;&#x4F5C;&#x3067;&#x306F;&#x56F0;&#x96E3;&#x306A;
&#x30D4;&#x30C3;&#x30C1;&#x30A4;&#x30F3;&#x3001;&#x30D4;&#x30C3;&#x30C1;&#x30A2;&#x30A6;&#x30C8;&#x7B49;&#x306E;&#x64CD;&#x4F5C;&#x3092;&#x3057;&#x305F;&#x3044;&#x5834;&#x5408;&#x7B49;&#x306B;&#x5229;&#x7528;&#x3057;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x307E;&#x305A;&#x3001;&#x304A;&#x624B;&#x6301;&#x3061;&#x306E;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30D5;&#x30A9;&#x30F3;&#x7AEF;&#x672B;&#x306B;Google Play &#x304B;&#x3089;&#x3000;&#x201C;MovaTesting&#x201D; &#x30A2;&#x30D7;&#x30EA;&#x3092;&#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x3057;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x30A2;&#x30D7;&#x30EA;&#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x5F8C;&#x306B;&#x201C;&#x30B9;&#x30DE;&#x30DB;&#x304B;&#x3089;&#x201D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x3067;&#x3001;&#x304A;&#x624B;&#x6301;&#x3061;&#x306E;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30D5;&#x30A9;&#x30F3;&#x304B;&#x3089;&#x30AF;&#x30E9;&#x30A6;&#x30C9;&#x4E0A;&#x306E;MovaTesting &#x306E;&#x7AEF;&#x672B;&#x3092;&#x64CD;&#x4F5C;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;<br>&#x3000;
<img src="operation13.png" alt=""><br>&#x3000;&#x201C;&#x4EBA;&#x5DE5;&#x77E5;&#x80FD;&#x306B;&#x5229;&#x7528;&#x201D;&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x307F;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x307E;&#x305A;&#x3001;&#x201C;&#x30A2;&#x30D7;&#x30EA;&#x9078;&#x629E;&#x201D;&#x3067;&#x30C6;&#x30B9;&#x30C8;&#x5BFE;&#x8C61;&#x3068;&#x3059;&#x308B;&#x30A2;&#x30D7;&#x30EA;&#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x30A2;&#x30D7;&#x30EA;&#x306E;&#x8D77;&#x52D5;&#x304C;&#x5DE6;&#x306E;&#x7AEF;&#x672B;&#x753B;&#x9762;&#x3067;&#x78BA;&#x8A8D;&#x3067;&#x304D;&#x305F;&#x3089;&#x3001;&#x201C;&#x4EBA;&#x5DE5;&#x77E5;&#x80FD;&#x306B;&#x5229;&#x7528;&#x201D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;  </p>
<p><img src="operation14.png" alt=""><br>&#x3000;&#x201C;&#x4EBA;&#x5DE5;&#x77E5;&#x80FD;&#x306B;&#x5229;&#x7528;&#x201D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3068;&#x30A2;&#x30D7;&#x30EA;&#x304C;&#x8D77;&#x52D5;&#x3057;&#x3001;&#x53F3;&#x5074;&#x306E;&#x753B;&#x9762;&#x304C;&#x201C;&#x5404;&#x7A2E;&#x64CD;&#x4F5C;&#x201D;&#x304B;&#x3089;&#x201C;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x201D; &#x753B;&#x9762;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x3053;&#x3067;&#x3001;&#x5DE6;&#x306E;&#x7AEF;&#x672B;&#x64CD;&#x4F5C;&#x753B;&#x9762;&#x3067;&#x3001;&#x7AEF;&#x672B;&#x3092;&#x30D1;&#x30BD;&#x30B3;&#x30F3;&#x3067;&#x64CD;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x304F;&#x4E8B;&#x3067;&#x3001;&#x30C6;&#x30B9;&#x30C8;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x3092;&#x81EA;&#x52D5;&#x3067;&#x751F;&#x6210;&#x3057;&#x3066;&#x3044;&#x304D;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x306A;&#x304A;&#x3001;&#x304A;&#x624B;&#x6301;&#x3061;&#x306E;&#x30B9;&#x30DE;&#x30FC;&#x30C8;&#x30D5;&#x30A9;&#x30F3;&#x7AEF;&#x672B;&#x3092;&#x64CD;&#x4F5C;&#x3057;&#x3066;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x3092;&#x81EA;&#x52D5;&#x751F;&#x6210;&#x3057;&#x305F;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;&#x5DE6;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x306E;&#x201C;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x751F;&#x6210;&#x201D;&#x304B;&#x3089;&#x624B;&#x9806;&#x306B;&#x6CBF;&#x3063;&#x3066;&#x3001;&#x3054;&#x5229;&#x7528;&#x4E0B;&#x3055;&#x3044;&#x3002;<br>&#x3000;
<img src="operation15.png" alt=""><br>&#x3000;&#x30C6;&#x30B9;&#x30C8;&#x3092;&#x3057;&#x3066;&#x3044;&#x304F;&#x3068;&#x4E0A;&#x8A18;&#x306E;&#x69D8;&#x306B;&#x201C;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x201D;&#x753B;&#x9762;&#x306B;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x304C;&#x751F;&#x6210;&#x3055;&#x308C;&#x3066;&#x3044;&#x304D;&#x307E;&#x3059;&#x3002;<br>&#x3000;
<img src="operation16.png" alt=""><br>&#x3000;&#x30D1;&#x30BD;&#x30B3;&#x30F3;&#x306B;&#x3088;&#x308B;&#x7AEF;&#x672B;&#x64CD;&#x4F5C;&#x3067;&#x306E;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x751F;&#x6210;&#x304C;&#x5B8C;&#x4E86;&#x3057;&#x305F;&#x3089;
&#x201C;&#x7D42;&#x4E86;&#x201D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3002;
&#x3000;&#x3053;&#x308C;&#x3067;&#x3001;&#x4F5C;&#x6210;&#x3057;&#x305F;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x304C;&#x4FDD;&#x5B58;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;<br>&#x3000;
<img src="operation17.png" alt=""><br>&#x3000;&#x6B21;&#x306B;&#x30C6;&#x30B9;&#x30C8;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x306E;&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x3092;&#x884C;&#x3044;&#x307E;&#x3059;&#x3002;&#x201C;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x306E;&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x201D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x307F;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x3092;&#x4FEE;&#x6B63;&#x3057;&#x306A;&#x304C;&#x3089;&#x3001;&#x753B;&#x9762;&#x306E;&#x52D5;&#x304D;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x305F;&#x3044;&#x6642;&#x306B;&#x5229;&#x7528;&#x3059;&#x308B;&#x6A5F;&#x80FD;&#x3067;&#x3059;&#x3002;<br>&#x3000;
<img src="operation18.png" alt=""><br>&#x3000;&#x201C;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x306E;&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x201D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3068;&#x3001;&#x4E0A;&#x8A18;&#x306E;&#x3088;&#x3046;&#x306B;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x305F;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x4E00;&#x89A7;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x3059;&#x308B;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x3092;&#x9078;&#x629E;&#x3057;&#x3066;&#x3001;&#x201C;Select&#x201D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;<br>&#x3000;
<img src="operation19.png" alt=""><br>&#x3000;&#x201C;Select&#x201D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x62BC;&#x3059;&#x3068;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x4E0A;&#x8A18;&#x753B;&#x9762;&#x306B;&#x5207;&#x308A;&#x66FF;&#x308F;&#x308A;&#x307E;&#x3059;&#x3002;&#x53F3;&#x4E0A;&#x306E;&#x518D;&#x751F;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x62BC;&#x305B;&#x3070;&#x3001;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x304C;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x3001;&#x5DE6;&#x306E;&#x7AEF;&#x672B;&#x753B;&#x9762;&#x306F;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x306B;&#x8A18;&#x8F09;&#x3055;&#x308C;&#x305F;&#x5185;&#x5BB9;&#x306E;&#x52D5;&#x304D;&#x304C;&#x958B;&#x59CB;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;<br>&#x3000;&#x53F3;&#x4E0A;&#x306E;&#x5404;&#x30DC;&#x30BF;&#x30F3;&#xFF08;&#x518D;&#x751F;&#x3001;&#x4E00;&#x6642;&#x505C;&#x6B62;&#x3001;&#x30B9;&#x30AD;&#x30C3;&#x30D7;&#x3001;&#x4FDD;&#x5B58;&#x3001;&#x30D5;&#x30EB;&#x30B9;&#x30AF;&#x30EA;&#x30FC;&#x30F3;&#xFF09;&#x7B49;&#x306E;&#x64CD;&#x4F5C;&#x3082;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;<br>&#x3000;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x306E;&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x3067;&#x306F;&#x3001;&#x53F3;&#x4E0A;&#x306E;&#x201C;save&#x201D;&#x30DC;&#x30BF;&#x30F3;&#x3067;&#x3001;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x306E;&#x4FDD;&#x5B58;&#x3092;&#x884C;&#x3044;&#x307E;&#x3059;&#x3002;</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="../Chapter1/dashboard.html" class="navigation navigation-prev " aria-label="Previous page: ダッシュボード"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="../Chapter3/script.html" class="navigation navigation-next " aria-label="Next page: スクリプト生成"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="../gitbook/app.js"></script>

<script>
require(["gitbook"], function(gitbook) {
    var config = {"fontSettings":{"theme":null,"family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
